Revit 2027 API
IUpdater.GetUpdaterName Method
 Returns a name that the Updater can be identified by to the user
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetUpdaterName()
Function GetUpdaterName As String
String^ GetUpdaterName()
abstract GetUpdaterName : unit -> string
Return Value
String
See Also
Reference
IUpdater Interface
Autodesk.Revit.DB Namespace